Repository: Hamad3bdulla/herdme
Catalog: Windows/HerdMe.Windows/Strings/*/Resources.resw
Source language: en_us
Languages: ar

# TinkerSnippetLabel.Text
source: Saved snippets
ar: المقتطفات المحفوظة

# TinkerSnippetDescription.Text
source: Named code saved for this site. Ctrl+S saves the editor.
ar: كود محفوظ باسم لهذا الموقع. Ctrl+S يحفظ المحرر.

# TinkerSnippetBox.PlaceholderText
source: No saved snippets
ar: لا توجد مقتطفات محفوظة

source: Save as snippet
ar: حفظ كمقتطف

source: Delete snippet
ar: حذف المقتطف

# TinkerSaveSnippetTooltip
source: Save as snippet (Ctrl+S)
ar: حفظ كمقتطف (Ctrl+S)

# TinkerDeleteSnippetTooltip
source: Delete the selected snippet
ar: حذف المقتطف المحدد

# TinkerSnippetNameHeader
source: Name
ar: الاسم

# TinkerSaveSnippetTitle
source: Save snippet for {0}
ar: حفظ مقتطف لـ {0}

# TinkerSaveSnippetConfirm
source: Save
ar: حفظ

# TinkerSaveSnippetCancel
source: Cancel
ar: إلغاء

# TinkerSnippetSaved
source: Saved snippet "{0}".
ar: تم حفظ المقتطف "{0}".

# TinkerSnippetDeleted
source: Deleted snippet "{0}".
ar: تم حذف المقتطف "{0}".

# TinkerSnippetNameEmpty
source: Enter a name for the snippet.
ar: أدخل اسمًا للمقتطف.

# TinkerSnippetNameTooLong
source: Snippet names are limited to 60 characters.
ar: أسماء المقتطفات محدودة بـ 60 حرفًا.

# TinkerRunningSelection
source: Running the selected code in {0}...
ar: جارٍ تشغيل الكود المحدد في {0}...

# TinkerOutputViewLabel.Text
source: Show as
ar: العرض كـ

# TinkerOutputViewDump.Content
source: Dump
ar: تفريغ

# TinkerOutputViewJson.Content
source: JSON
ar: تنسيق JSON

# TinkerOutputViewTable.Content
source: Table
ar: جدول

# TinkerOutputViewRunAgain
source: Run the code again to show it in this view.
ar: شغّل الكود مرة أخرى لعرضه بهذا الشكل.

# TinkerTableMoreRows
source: ({0} more rows not shown)
ar: (لم يتم عرض {0} صفوف أخرى)

# GeneralMailNotificationsTitle.Text
source: New mail
ar: بريد جديد

# GeneralMailNotificationsDescription.Text
source: Notify with the sender, subject and an Open button when a mail is captured while the Mail page is not open.
ar: إشعار بالمرسل والموضوع وزر فتح عند التقاط رسالة وصفحة البريد غير مفتوحة.

source: New mail notifications
ar: إشعارات البريد الجديد

# NotificationMailNoSubject
source: (no subject)
ar: (بدون موضوع)

# NotificationMailTitle
source: New mail
ar: بريد جديد

# NotificationMailFrom
source: New mail from {0}
ar: بريد جديد من {0}

# NotificationMailMore
source: {0} ({1} unread)
ar: {0} ({1} غير مقروءة)

# NotificationActionOpenMail
source: Open
ar: فتح

source: Browse tables
ar: استعراض الجداول

# SitesDatabaseBrowseLabel.Text
source: Browse tables (read-only)
ar: استعراض الجداول (قراءة فقط)

# SitesDatabasePeekTitle
source: Tables in {0}
ar: الجداول في {0}

# SitesDatabasePeekTableField
source: Table
ar: الجدول

# SitesDatabasePeekLoadingTables
source: Loading tables...
ar: جارٍ تحميل الجداول...

# SitesDatabasePeekPickTable
source: Choose a table
ar: اختر جدولاً

# SitesDatabasePeekTables
source: {0} tables. Read-only: nothing here can change your data.
ar: {0} جدول. قراءة فقط: لا شيء هنا يغيّر بياناتك.

# SitesDatabasePeekTablesLimited
source: Showing the first {0} tables. Read-only.
ar: يعرض أول {0} جدول. قراءة فقط.

# SitesDatabasePeekNoTables
source: This database has no tables yet. Run the migrations first.
ar: لا توجد جداول في قاعدة البيانات بعد. شغّل الـ migrations أولاً.

# SitesDatabasePeekLoadingRows
source: Reading {0}...
ar: جارٍ قراءة {0}...

# SitesDatabasePeekRows
source: {0} rows from {1}.
ar: {0} صف من {1}.

# SitesDatabasePeekRowsLimited
source: First {0} rows from {1}.
ar: أول {0} صف من {1}.

# SitesDatabasePeekEmpty
source: {0} is empty.
ar: {0} فارغ.

# SitesDatabasePeekTimedOut
source: The database did not answer in time.
ar: لم تستجب قاعدة البيانات في الوقت المحدد.

# SitesDatabasePeekRowsName
source: Table rows
ar: صفوف الجدول

# SitesDatabasePeekCopy
source: Copy
ar: نسخ

# SitesDatabasePeekInvalidTable
source: That table name cannot be read.
ar: لا يمكن قراءة اسم الجدول هذا.

# SitesDatabasePeekFailed
source: The database could not be read.
ar: تعذّرت قراءة قاعدة البيانات.
